Repository: terraslav/matrix-gtk3
Catalog: locale/*/LC_MESSAGES/matrix.po
Languages: ru

source: Digits editing
ru: Редактирование чисел

source: Seerching solved
ru: Идет поиск решения

source: please wait
ru: подождите немного

source: Search result
ru: Результаты поиска

source: Not found:
ru: Ничего не найдено по запросу:

source: colores
ru: цветов

source: colors
ru: цвета

source: Number
ru: Номер

source: Name
ru: Название

source: Size
ru: Размер

source: Numb.colors
ru: Кол.цветов

source: monochrome
ru: черно-белый

source: Find error!
ru: Ошибка поиска

source: Sorry, its big number!
ru: Слишком большой номер

source: Solver error!
ru: Ошибка при решении

source: File
ru: Файл

source: Nanogramm puzzles
ru: Нанограммы-головоломки

source: xdg-open https://en.wikipedia.org/wiki/Nonogram
ru: xdg-open https://ru.wikipedia.org/wiki/Японский_кроссворд

source: My page vkontakte
ru: Моя страница вконтакте

source: Change current color
ru: Изменение цвета

source: Properties
ru: Параметры файла

source: choose color
ru: Выбор цвета

source: The format JCR doesn't support change of colors
ru: Формат JCR не поддерживает изменения палитры цветов

source: Palette
ru: Палитра

source: New puzzle
ru: Новый пазл

source: Noname
ru: Безымянный

source: Top digits number
ru: Размер поля оцифровки сверху

source: Left digits number
ru: Размер поля оцифровки слева

source: Height matrix
ru: Высота поля матрицы

source: Width matrix
ru: Ширина поля матрицы

source: File name:
ru: Имя файла:

source: Color puzzle
ru: Цветная нанограмма

source: About
ru: Об авторе

source: Japaness nanogramm manipulate program
ru: Программа для создания, тестирования и решения японских нанограмм

source: Save nanogramm as
ru: Сохранить нанограмму как

source: Open nanogramm
ru: Открыть нанограмму

source: Nanogramms
ru: Нанограммы

source: Pictures(BMP) non-compessed
ru: Несжатые рисунки BMP

source: All files
ru: Все файлы

source: Opened file: %s
ru: Открыт файл: %s

source: The compressed bitmap is not supported!
ru: Сжатие в файлах BMP не поддерживается!

source: Width and height image more that 127 cells!
ru: Ширина и высота картинки не должна превышать значения 127

source: Puzzle changes
ru: Нанограмма имеет изменения

source: Save changes?
ru: Сохранить изменения

source: Access denied! Don`t save
ru: Не могу сохранить файл - доступ запрещён!

source: file.
ru: файл.

source: System error
ru: Системная ошибка

source: Couldn't open library directory:
ru: Не могу открыть папку библиотеки:

source: Please update library!
ru: Пожалуйста обновите библиотеку

source: No puzzle files found in folder: %s
ru: Нанограмм в папке %s не найдено

source: Open folder to demo
ru: Открыть папку с нанограммами

source: Error opening file: %s File format not suitable!
ru: Ошибка открытия файла: %s неизвестный формат файла!

source: Only the part seen on the screen nanograms is exported. I recommend to choose suitable scale.
ru: Экспортируется только видимая на экране часть нанограммы. Рекомендую выбрать более подходящий масштаб.

source: Export view screen to file: %s completed!
ru: Экспорт видимого изображения в файл: %s выполнено!

source: Error export
ru: Ошибка экспорта!

source: Don't save expotrs
ru: Не могу сохранить файл экспорта!

source: Undo
ru: Отмена

source: undo last move
ru: отмена последнего действия

source: Redo
ru: Повтор

source: redo prev move
ru: повтор последнего отменённого действия

source: Solve
ru: Решить

source: to solve a nanogramm
ru: автоматически решить или пошагово помочь решить нанограмму

source: Counts
ru: Пересчитать

source: to count a matrix
ru: пересчитать цифры по содержимому матрицы

source: Clear
ru: Очистить

source: clear matrix
ru: очистить матрицу

source: Grid
ru: Сетка

source: Greed cells
ru: показать сетку

source: 5x5
ru: 5х5 сетка

source: 5x bold grid
ru: 5х5 сетка

source: Pen
ru: Карандаш

source: Painting pen
ru: Рисовать поклеточно

source: Rectangle
ru: Прямоугольник

source: Painting rectangles
ru: Рисовать прямоугольниками

source: Fill
ru: Заливка

source: Filling place
ru: Залить однородные клетки

source: Show palette
ru: показать/скрыть цветовую палитру

source: Increase (F4)
ru: Увеличить (F4)

source: increase view
ru: увеличить размер ячеек

source: Reduce (F3)
ru: Уменьшить (F3)

source: to reduce view
ru: Уменьшить размер ячеек

source: Adjust (F2)
ru: Подогнать (F2)

source: to adjust to a view
ru: подогнать к экрану

source: New
ru: Новый

source: create new nanogramm
ru: создать новый пазл

source: Open
ru: Открыть

source: open nanogramm
ru: открыть новый пазл

source: Save
ru: Сохранить

source: save nanogramm
ru: сохранить пазл

source: Error! Too big digit.
ru: Ошибка! Цифра больше допустимого значения

source: Cursor position: %d/-%d x %d/-%d
ru: Позиция курсора: %d/-%d x %d/-%d

source: in %d row!
ru: в %d колонке!

source: in %d line!
ru: в %d строке!

source: Puzzle solved.
ru: Нанограмма решена!

source: Congratulation!
ru: Примите поздравления!

source: Horizontal and vertical numbers sums nonequivalent!
ru: Суммы верхней и левой оцифровок не совпадают!

source: Top digits summ: %d Left digits summ: %d
ru: Сумма цифр верхней оцифровки равна: %d Сумма цифр левой оцифровки равна: %d

source: Summ horisontal & vertical digits is not equivalent! Top summ = %d, left summ = %d
ru: Суммы верхней и левой оцифровок не совпадают! Сумма сверху: %d Сумма слева: %d

source: Summ digits and summ maked marix cells is not equivalent!
ru: Сумма оцифровки и сумма отмеченных ячеек не совпадают!

source: C_check_complete: not complete in column %d
ru: C_check_complete: колонка %d ещё не решена

source: C_check_complete: not complete in line %d
ru: C_check_complete: строка %d ещё не решена

source: Puzzle error!
ru: Ошибка в нанограмме!

source: Solved ready
ru: Расчет окончен

source: C_make_start_position: Error overflow in row: %d, calculate row len: %d
ru: C_make_start_position: ошибка переполнения в колонке: %d, расчитанная длина: %d

source: No more logic continued!
ru: Больше не вижу осмысленных действий!

source: Lesson message
ru: Сообщение режима обучения

source: No more logic continued!
ru: Больше не нахожу осмысленных действий!

source: C_test_step: no calcing cell in current step
ru: C_test_step: не расшитаны ячейки при текущем вхождении

source: Error in %s: %d Continued with cleared puzzle?
ru: Ошибка в: %s: %d Очистить матрицу и продолжить?

source: line
ru: строке

source: column
ru: колонке

source: C_make_start_position_color: overflow in line %d
ru: C_make_start_position_color: выход за границы матрицы в строке %d

source: C_make_access_color: Error make c_st_pos, line %d overflow
ru: C_make_access_color: Ошибка отметки c_st_pos, строка %d переполнена

source: C_make_access_color: Error make c_en_pos, line %d overflow
ru: C_make_access_color: Ошибка отметки c_en_pos, строка %d переполнена

source: Summ digit color:
ru: Сумма цифр цвета:

source: different on:
ru: отличается на:

source: Puzzle digits error!
ru: Имеется ошибка в оцифровке!

source: C_make_overlapping_color: make nothing!
ru: C_make_overlapping_color: Нечего отмечать!

source: c_scan_line_color: st_pos. not defined unit place:%d в %s: %d
ru: c_scan_line_color: st_pos. не определено место для юнита:%d в %s: %d

source: c_scan_line_color: en_pos. not defined unit place:%d в %s: %d
ru: c_scan_line_color: en_pos. не определено место для юнита:%d в %s: %d

source: Begining search solved...
ru: Начинаю поиск решения...

source: No more solve!
ru: Больше ничем помочь не могу=(

source: White
ru: Белый

source: Black
ru: Чёрный

source: Blue
ru: Синий

source: Red
ru: Красный

source: Magenta
ru: пурпурный

source: Green
ru: Зелёный

source: Cyan
ru: Морск.волны

source: Yallow
ru: Жёлтый

source: Silver
ru: Серебро

source: Gray
ru: Серый

source: Navy
ru: Морской

source: Purple
ru: Лиловый

source: Lime
ru: Известь

source: Teal
ru: Чирок

source: Olive
ru: Оливковый

source: Aquamarine
ru: Аквамарин

source: Orange
ru: Оранжевый

source: Pink
ru: Розовый

source: Maroon
ru: Тёмно-бордовый

source: /_File
ru: /_Файл

source: /File/_New...
ru: /Файл/_Новый

source: /File/_Open...
ru: /Файл/_Открыть

source: /File/_Save
ru: /Файл/_Сохранить

source: /File/Save _As
ru: /Файл/Сахранить _как

source: /File/_Export to PNG
ru: /Файл/_Экспорт в PNG

source: /File/Print...
ru: /Файл/_Печать...

source: /File/Feat_ures
ru: /Файл/_Свойства нанограммы

source: /File/_Quit
ru: /Файл/В_ыход

source: /File/sep
ru: /Файл/sep

source: /_Edit
ru: /_Правка

source: /Edit/_Undo
ru: /Правка/_Отмена

source: /Edit/_Redo
ru: /Правка/_Повтор

source: /Edit/_Invert colors
ru: /Правка/_Инверсия палитры

source: /Edit/_Paste
ru: /Правка/_Вставить

source: /Edit/Slide l_eft
ru: /Правка/Сдвинуть в_лево

source: /Edit/Slide _right
ru: /Правка/Сдвинуть в_право

source: /Edit/Slide _up
ru: /Правка/Сдвинуть в_верх

source: /Edit/Slide _down
ru: /Правка/Сдвинуть в_низ

source: /Edit/Clear _Puzzle
ru: /Правка/Очистить _матрицу

source: /Edit/Clear _Digits
ru: /Правка/Очистить оци_фровку

source: /Edit/Clear p_uzzle markers
ru: /Правка/Очистить маркеры ма_трицы

source: /Edit/Clear d_igits marker
ru: /Правка/Очистить маркеры о_цифровки

source: /Edit/P_roperty...
ru: /Правка/Па_раметры файла

source: /Edit/sep
ru: /Правка/sep

source: /_View
ru: /_Вид

source: /View/_More
ru: /_Вид/Больше

source: /View/_Less
ru: /Вид/Меньше

source: /View/_Reset
ru: /Вид/Подогнать

source: /View/_Toolbar
ru: /Вид/Панель _инструментов

source: /View/_Statusbar
ru: /Вид/Панель _статуса

source: /View/_Palette
ru: /Вид/Палитра

source: /View/_Grid
ru: /Вид/Сетка

source: /View/Gr_id 5x5
ru: /Вид/Сетка 5х5

source: /View/sep
ru: /Вид/sep

source: /_Puzzle
ru: /Па_зл

source: /Puzzle/_Solve puzzle
ru: /Пазл/_Решить

source: /Puzzle/_Calculate digits
ru: /Пазл/Расчитать _оцифровку

source: /Puzzle/_Make overlapped
ru: /Пазл/Отметить _перекрытые ячейки

source: /_Settings
ru: /_Установки

source: /Settings/_Animate
ru: /Установки/Анимация

source: /Settings/_lesson (step by step)
ru: /Установки/Режим обучения

source: /Settings/_View name
ru: /Установки/Показывать название пазла

source: /Settings/Help level
ru: /Установки/Уровень помощи

source: /Settings/manual solved
ru: /Установки/всё врукопашную

source: /Settings/automark digits
ru: /Установки/автозачеркивание цифр

source: /Settings/automark lines
ru: /Установки/автозачеркивание строк

source: /Settings/advanced help
ru: /Установки/продвинутый режим

source: /Settings/persuasive mode
ru: /Установки/навязчивый режим

source: /Settings/sep
ru: /Установки/sep

source: /_Library
ru: /_Библиотека

source: /Library/_Update lybrary
ru: /Библиотека/Обновить _библиотеку

source: /Library/Open random black nanogramm
ru: /Библиотека/Случайный черный пазл

source: /Library/Open random color nanogramm
ru: /Библиотека/Случайный цветной пазл

source: /Library/Find
ru: /Библиотека/Поиск

source: /Library/Sep
ru: /Библиотека/Sep

source: /Library/_Demo
ru: /Библиотека/_Демонстрация

source: /Library/_Next
ru: /Библиотека/Следующий

source: /Library/_Prev
ru: /Библиотека/Предыдущий

source: /Library/_Open_URL
ru: /Библиотека/_Открыть источник

source: /_Help
ru: /_Справка

source: /Help/_Help
ru: /Справка/_О нанограммах

source: /Help/_About
ru: /Справка/_Об авторе

source: Number is not select!
ru: Не выбран номер пазла!

source: Error opening bitmap pictures.
ru: Ошибка открытия BMP-файла.

source: Status:
ru: Статус:

source: error in matrix!
ru: присутствуют ошибки в решении!

source: no logical decision!
ru: не имеет прямого решения!

source: OK!
ru: Всё отлично!

source: Difficulties: %d
ru: Сложность: %d

source: solved!
ru: Решено!

source: Nanogramm features
ru: Особенности нанограммы

source: Digits summ: %d Top digits number: %d Left digits number: %d Filling fild on: %.1f%% Guessed on: %.1f%%
ru: Сумма оцифровки: %d Цифр сверху: %d Цифр слева: %d Заполнение поля: %.1f%% Отгадано: %.1f%%

source: Library error!
ru: Ошибка библиотеки!

source: C_make_overlapping: make nothing!
ru: C_make_overlapping: ничего не отмечено=)

source: mistake in digitization!
ru: ошибка в оцифровке!

source: digitizations non equivalent!
ru: оцифровки не эквивалентны!

source: mistake in attempt of the decision!
ru: ошибка при попытке решения!

source: Error: discrepancy of the drawing and digitization
ru: Ошибка: несоответствие рисунка и оцифровки

source: Matrix is empty!
ru: Нечего считать - матрица пуста!

source: Save changes
ru: Сохранение изменений

source: JCR-file format preservation doesn't support changes in a matrix body! Choose new name?
ru: Формат JCR не поддерживает сохранения содержимого в матрице рисунка! Сохранить файл под другим именем?

source: Im i`s dead
ru: Мля, меня убили=(

source: Error in %s - %d
ru: Ошибка в %s - %d

source: Library
ru: Библиотека

source: Updates library started!
ru: Запущено обновление библиотеки!

source: Updates library stoped!
ru: Обновление библиотеки остановлено!

source: Updates library finished!
ru: Обновление библиотеки завершено.

source: Name: %s
ru: Название: %s

source: Puzzle name:
ru: Название рисунка:

source: Select number or name puzzle:
ru: Введите номер или название пазла:

source: numbers are locally available
ru: локально доступны номера

source: Search in library
ru: Поиск в библиотеке

source: The puzzle number %d doesn't exist!
ru: Пазл номер %d не существует!

source: Really quit?
ru: Хорошо подумал?

source: Puzzle number is empty!
ru: Эта ячейка пуста.

source: Sorry, puzzle number is empty! Select other number.
ru: Извините, эта ячейка пуста. Выберите другой номер.
